In [15]:
import sqlite3

conn = sqlite3.connect('test.db')

print("Opened database successfully")

Opened database successfully

In [16]:
cursor = conn .cursor()
cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")

In [17]:
X= '''CREATE TABLE IF NOT EXISTS projects (
	id integer PRIMARY KEY,
	name text NOT NULL,
	begin_date text,
	end_date text
); '''

In [19]:
conn.execute(X)
print("Table created")

Table created

In [20]:
conn.commit()

In [21]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32)")
 
X.commit()

Y.close()

In [25]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32),('2020-01-01','Mike','Joseph',30),('2020-01-01','Ann','Maria',32);")

 
X.commit()

Y.close()

In [26]:
import sqlite3
 
conn = sqlite3.connect('NewDB.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)

students = [('John', '8', 'A'),
   ('Adam', '8', 'B'),
   ('Ann', '10', 'A'),
]

cursor.executemany('INSERT INTO STUDENT VALUES (?,?,?)', students)

print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [14]:
conn.close()

In [28]:
import sqlite3
 
conn = sqlite3.connect('NewDB4.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [29]:
import sqlite3
 
conn = sqlite3.connect('NewDB5.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE CLASS = '10'")

print(cursor.fetchall())
  
conn.commit()
conn.close()

[('Ann', '10', 'A')]

In [30]:
import sqlite3
 
conn = sqlite3.connect('NewDB7.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE NAME Like'A%' ")

print(cursor.fetchall())
  
conn.commit()
conn.close()

[('Adam', '8', 'B'), ('Ann', '10', 'A')]